VbConsole/VbConsole/SOAPEnvelope.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
							 xmlns:tem="http://tempuri.org/">
	<soap:Body>
		<tem:ConsultaConsolidadaPagamentoPorData>
			<Parametros>@string</Parametros>
		</tem:ConsultaConsolidadaPagamentoPorData>
	</soap:Body>
</soap:Envelope>
